Strömungssimulation/elbowSnappy2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    elbowWall
    {
        type            noSlip;
    }
    injectorWall
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    injectorInlet
    {
        type            fixedValue;
        value           uniform (0 2.5 0);
    }
    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
